app/controllers/authors_controller.rb

  def show
    @author= Author.find_by id: params[:id]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]