app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @book = Book.find_by id: params[:id]

INSERT INTO "books" ("title", "author", "price", "photo_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new
    @book.title = params[:book][:title]
    @book.author = params[:book][:author]
    @book.price = params[:book][:price]
    @book.photo_url = params[:book][:photo_url]

    if @book.save